[
  {
    "title": "Experiencing a Culture through travelling: ",
    "subtitle": "Guest: Brandon McCarthy",
    "image": ["IMG_7703.jpg","IMG_7704.jpg"],
    "date": "10/15/2019",
    "text": "Gathering up the courage to travel to another country is extremely nerve-wracking and exciting at the SAME time. Now you may have gone on a vacation where you travelled and got to spend a week in Cuba or even a chance to spend a weekend in Florida, but I think 7 days is just not a long enough time to call it “travelling”. Then what do I define travelling as? <br> <b>What is travelling?</b> <br> Travelling to me is experiencing the culture of a country. In order to experience the culture, you are required to live like the locals do. Therefore, I believe that spending 30 days or longer in another country is beneficial to experiencing the culture since you are forced to stay accustomed to their ways of living. Essentially, if you spend at least a month in a country, you learn the basic tips and tricks or “unwritten” rules of the country. <br><br> I had the opportunity to speak with a long-time friend of mine, Brandon McCarthy, about his time living in Thailand. He lived there for around 40 days and I got to ask him a few questions about experiencing the culture of another country.<br> <b>Jordan Malcolm:</b><br> What was your favourite part about living in Thailand for over a month?<br> <b>Brandon McCarthy:</b><br> My favourite part was getting to go on a bunch of cool excursions, I got to go scuba diving and I got to see a bunch of animals I don’t get to see here and get super close with them. And also, the shopping too, the shopping was amazing! They had these high-end shopping malls, but they also had these bootleg malls for really cheap goods, and they were selling a lot of fake products. Something that would definitely get shut down here in Canada. <br> <b>Jordan Malcolm:</b><br> If you were to compare living in Thailand to Canada, what would the biggest difference be?<br> <b>Brandon McCarthy: </b><br>I mean things are so cheap there, which is amazing since everything was almost half the price of things here. And then the culture, there is a big sense of community there. They kind of self-police themselves. <br> <b>Jordan Malcolm:</b><br> How lenient are they with the prices and accommodations? <br> <b>Brandon McCarthy: </b><br> So, you can bargain there and it’s really cool, you can actually bring out your calculator and give your price to the shop owners.<br> <br> As a result from this interview, I realized that as much as I could think of questions to ask about the culture of Thailand, no answers will replace the experience of physically going to the country itself.  - Jordan M."

  }
]
